#+title: Day8

** Compilation and Execution

- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_groups_communicators.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_groups_communicators.c -o mpi_groups_communicators.out -lm
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_groups_communicators.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_groups_communicators.out 10
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 10 ./mpi_groups_communicators.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  World Rank: 1, New Rank: 0, New Size: 5
  World Rank: 1, New Comm Sum: 20
  World Rank: 0, New Rank: 0, New Size: 5
  World Rank: 0, New Comm Sum: 20
  World Rank: 3, New Rank: 1, New Size: 5
  World Rank: 3, New Comm Sum: 20
  World Rank: 2, New Rank: 1, New Size: 5
  World Rank: 2, New Comm Sum: 20
  World Rank: 4, New Rank: 2, New Size: 5
  World Rank: 4, New Comm Sum: 20
  World Rank: 5, New Rank: 2, New Size: 5
  World Rank: 5, New Comm Sum: 20
  World Rank: 9, New Rank: 4, New Size: 5
  World Rank: 9, New Comm Sum: 20
  World Rank: 7, New Rank: 3, New Size: 5
  World Rank: 7, New Comm Sum: 20
  World Rank: 8, New Rank: 4, New Size: 5
  World Rank: 8, New Comm Sum: 20
  World Rank: 6, New Rank: 3, New Size: 5
  World Rank: 6, New Comm Sum: 20

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example


This example demonstrates how to create and use groups and communicators in MPI to organize and manage process communication in parallel applications.
** Compilation and Execution

- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_task_parallelism_manual_groups.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_task_parallelism_manual_groups.c -o mpi_task_parallelism_manual_groups.out -lm
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_task_parallelism_manual_groups.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_task_parallelism_manual_groups.out 10
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 10 ./mpi_task_parallelism_manual_groups.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 1 performing I/O operations
  Process 3 performing I/O operations
  Process 5 performing I/O operations
  Process 9 performing I/O operations
  Process 7 performing I/O operations
  Process 0 performing computation
  Process 6 performing computation
  Process 4 performing computation
  Process 8 performing computation
  Process 2 performing computation

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

** Compilation and Execution

- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_task_parallelism.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_task_parallelism.c -o mpi_task_parallelism.out -lm
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_task_parallelism.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_task_parallelism.out 10
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 10 ./mpi_task_parallelism.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################

  Process 0 performing computation
  Process 1 performing I/O operations
  Process 8 performing computation
  Process 6 performing computation
  Process 4 performing computation
  Process 3 performing I/O operations
  Process 7 performing I/O operations
  Process 9 performing I/O operations
  Process 5 performing I/O operations
  Process 2 performing computation

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

* Task1
#+begin_src C :tangle task1.c
#include <mpi.h>
#include <stdio.h>

long long sumOfSquares(long long *arr, int size){
    long long sum = 0;
    for(int i = 0; i < size; i++){
        sum+= arr[i] * arr[i];
    }
    return sum;
}

long long sum(long long *arr, int size){
    long long sum = 0;
    for(int i = 0; i < size; i++){
        sum+= arr[i];
    }
    return sum;
}


int main(int argc, char** argv) {
    MPI_Init(&argc, &argv);

    int world_rank, world_size;
    MPI_Comm_rank(MPI_COMM_WORLD, &world_rank);
    MPI_Comm_size(MPI_COMM_WORLD, &world_size);

    // Split the world group into two groups
    int color = world_rank % 2;  // Determine color based on rank
    MPI_Comm new_comm;
    MPI_Comm_split(MPI_COMM_WORLD, color, world_rank, &new_comm);

    // Get the new rank and size in the new communicator
    int new_rank, new_size;
    MPI_Comm_rank(new_comm, &new_rank);
    MPI_Comm_size(new_comm, &new_size);

    //printf("World Rank: %d, New Rank: %d, New Size: %d\n", world_rank, new_rank, new_size);
    const int data_size = 10000;
    long long data[data_size];
    if(new_rank == 0){
        for(int i = 0; i < data_size; i++){
            data[i] = i + 1;
        }
    }
    //data broadcasted to each process in new_comm
    int chunk_size = data_size / new_size;
    long long local_array[chunk_size];
    long long local_sum = 0;
    long long local_square_sum = 0;
    MPI_Scatter(data, chunk_size, MPI_LONG_LONG, local_array, chunk_size, MPI_LONG_LONG, 0, new_comm);
    // Perform some communication within the new communicator
    if(color == 0){
        local_sum = sum(local_array, chunk_size);
    }
    if(color == 1){
        local_square_sum = sumOfSquares(local_array, chunk_size);
    }
    long long final_sum = 0;
    long long final_square_sum = 0;
    MPI_Allreduce(&local_sum, &final_sum, 1, MPI_LONG_LONG, MPI_SUM, new_comm);
    MPI_Allreduce(&local_square_sum, &final_square_sum, 1, MPI_LONG_LONG, MPI_SUM, new_comm);
    if(new_rank == 0){
        if(color == 0)
            printf("World Rank: %d, Sum of arrays: %lld\n", world_rank, final_sum);
        if(color == 1)
            printf("World Rank: %d, Sum of squares of arrays: %lld\n", world_rank, final_square_sum);
    }

    // Free the new communicator and group
    MPI_Comm_free(&new_comm);

    MPI_Finalize();
    return 0;
}
#+end_src

#+begin_src bash :results output :exports both
bash compile.sh task1.c
#+end_src

#+RESULTS:
: ------------------------------------------------------------------
: Command executed: mpicc task1.c -o task1.out -lm
: ------------------------------------------------------------------
: Compilation successful. Check at task1.out
: ------------------------------------------------------------------

#+begin_src bash :results output :exports both
bash run.sh ./task1.out 10
#+end_src

#+RESULTS:
#+begin_example
------------------------------------------------------------------
Command executed: mpirun -np 10 ./task1.out
------------------------------------------------------------------
##################################################################
##########                    OUTPUT                    ##########
##################################################################

World Rank: 1, Sum of squares of arrays: 333383335000
World Rank: 0, Sum of arrays: 50005000

##################################################################
##########                     DONE                     ##########
##################################################################
#+end_example

** Compilation and Execution

- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_parallel_pi.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_parallel_pi.c -o mpi_parallel_pi.out -lm
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_parallel_pi.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_parallel_pi.out 10
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 10 ./mpi_parallel_pi.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################


  Value of pi is = 3.1415926555895561
  Execution time is = 0.546890 seconds

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

** Compilation and Execution

- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_parallel_pi1.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_parallel_pi1.c -o mpi_parallel_pi1.out -lm
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_parallel_pi1.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_parallel_pi.out 10
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 10 ./mpi_parallel_pi.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################


  Value of pi is = 3.1415926555895561
  Execution time is = 0.820085 seconds

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

** Compilation and Execution

- Compile the program:
  #+BEGIN_SRC sh :results output :exports both
  bash compile.sh mpi_parallel_prime.c
  #+END_SRC

  #+RESULTS:
  : ------------------------------------------------------------------
  : Command executed: mpicc mpi_parallel_prime.c -o mpi_parallel_prime.out -lm
  : ------------------------------------------------------------------
  : Compilation successful. Check at mpi_parallel_prime.out
  : ------------------------------------------------------------------

- Run the program:
  #+BEGIN_SRC sh :results output :exports both
  bash run.sh ./mpi_parallel_prime.out 10
  #+END_SRC

  #+RESULTS:
  #+begin_example
  ------------------------------------------------------------------
  Command executed: mpirun -np 10 ./mpi_parallel_prime.out
  ------------------------------------------------------------------
  ##################################################################
  ##########                    OUTPUT                    ##########
  ##################################################################


   Number of prime numbers = 664580
   Execution time is = 1.714277 seconds

  ##################################################################
  ##########                     DONE                     ##########
  ##################################################################
  #+end_example

* Serial Matrix Addition
#+begin_src C :tangle serial_mat_add.c
#include<stdio.h>
#include<stdlib.h>

int main(int argc, char **argv){
    int i, j, myid, size, n = 400;
    int **m1, **m2, **sumMat;
    m1 = (int**)malloc(sizeof(int*) * n);
    m2 = (int**)malloc(sizeof(int*) * n);
    sumMat = (int**)malloc(sizeof(int*) * n);
    for(i = 0; i < n; i++){
        m1[i] = (int*)malloc(sizeof(int) * n);
        m2[i] = (int*)malloc(sizeof(int) * n);
        for(j = 0; j < n; j++){
            m1[i][j] = 1;
            m2[i][j] = 1;
        }
    }
    /*
    for(i = 0; i < n; i++){
        for(j = 0; j < n; j++){
            printf("%d ",m1[i][j]);
        }
        printf("\n");
    }
    for(i = 0; i < n; i++){
        for(j = 0; j < n; j++){
            printf("%d ",m2[i][j]);
        }
        printf("\n");
    }*/

    for(i = 0; i < n; i++){
        sumMat[i] = (int*)malloc(sizeof(int) * n);
        for(j = 0; j < n; j++){
            sumMat[i][j] = m1[i][j] + m2[i][j];
        }
    }
    for(i = 0; i < n; i++){
        for(j = 0; j < n; j++){
            printf("%d ",sumMat[i][j]);
        }
        printf("\n");
    }

    return 0;
}
#+end_src

#+begin_src bash :results output :exports both
bash compile.sh serial_mat_add.c
#+end_src

#+RESULTS:
: ------------------------------------------------------------------
: Command executed: mpicc serial_mat_add.c -o serial_mat_add.out -lm
: ------------------------------------------------------------------
: Compilation successful. Check at serial_mat_add.out
: ------------------------------------------------------------------

#+begin_src bash :results output :exports both
bash run.sh ./serial_mat_add.out 10 > output.txt
#+end_src

#+RESULTS:
